## Proxmox Terraform Plan
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # proxmox_vm_qemu.vm["haproxy-testing.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = (known after apply)
      + cipassword             = (sensitive value)
      + ciupgrade              = false
      + ciuser                 = "suporte"
      + clone_wait             = 10
      + cores                  = 1
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = false
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.24/24,gw=192.168.1.1,ip6=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 1024
      + name                   = "haproxy-testing"
      + nameserver             = "192.168.1.3"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIP+mJj63c+7o+Bu40wNnXwTpXkPTpGJA9OIprmNoljKI pedro@pedro-Legion-5-16IRX9"
      + tablet                 = true
      + tags                   = "terraform"
      + target_node            = "node01"
      + unused_disk            = (known after apply)
      + vm_state               = "running"
      + vmid                   = (known after apply)

      + disks {
          + ide {
              + ide1 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "8G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.vm["k8s-home.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = (known after apply)
      + cipassword             = (sensitive value)
      + ciupgrade              = false
      + ciuser                 = "suporte"
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = false
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.16/24,gw=192.168.1.1,ip6=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 32786
      + name                   = "k8s-home"
      + nameserver             = "192.168.1.3"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 2
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIP+mJj63c+7o+Bu40wNnXwTpXkPTpGJA9OIprmNoljKI pedro@pedro-Legion-5-16IRX9"
      + tablet                 = true
      + tags                   = "terraform"
      + target_node            = "node02"
      + unused_disk            = (known after apply)
      + vm_state               = "running"
      + vmid                   = (known after apply)

      + disks {
          + ide {
              + ide1 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "100G"
                      + storage              = "local-lvm"
                    }
                }
              + scsi1 {
                  + passthrough {
                      + backup               = true
                      + file                 = "/dev/disk/by-id/usb-SanDisk_Extreme_55DD_24399K401631-0:0"
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + replicate            = true
                      + size                 = (known after apply)
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.vm["k8s-testing-cp01.yaml"] will be destroyed
  # (because key ["k8s-testing-cp01.yaml"] is not in for_each map)
  - resource "proxmox_vm_qemu" "vm" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - agent_timeout          = 90 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0;ide2;net0" -> null
      - ciupgrade              = false -> null
      - clone_wait             = 10 -> null
      - cores                  = 4 -> null
      - cpu_type               = "host" -> null
      - current_node           = "node03" -> null
      - define_connection_info = true -> null
      - description            = "Managed by Terraform." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "node03/qemu/104" -> null
      - ipconfig0              = "ip=192.168.1.22/24,gw=192.168.1.1" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 8192 -> null
      - name                   = "k8s-testing-cp01" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = true -> null
      - sockets                = 1 -> null
      - tablet                 = true -> null
      - tags                   = "terraform" -> null
      - target_node            = "node03" -> null
      - unused_disk            = [] -> null
      - vm_state               = "stopped" -> null
      - vmid                   = 104 -> null
        # (12 unchanged attributes hidden)

      - disk {
          - backup               = true -> null
          - discard              = false -> null
          - emulatessd           = false -> null
          - id                   = 0 -> null
          - iops_r_burst         = 0 -> null
          - iops_r_burst_length  = 0 -> null
          - iops_r_concurrent    = 0 -> null
          - iops_wr_burst        = 0 -> null
          - iops_wr_burst_length = 0 -> null
          - iops_wr_concurrent   = 0 -> null
          - iothread             = false -> null
          - iso                  = "local:iso/talos-v1.10.3-metal-amd64.iso" -> null
          - linked_disk_id       = 0 -> null
          - mbps_r_burst         = 0 -> null
          - mbps_r_concurrent    = 0 -> null
          - mbps_wr_burst        = 0 -> null
          - mbps_wr_concurrent   = 0 -> null
          - passthrough          = false -> null
          - readonly             = false -> null
          - replicate            = false -> null
          - slot                 = "ide2" -> null
          - type                 = "cdrom" -> null
            # (8 unchanged attributes hidden)
        }
      - disk {
          - backup               = true -> null
          - discard              = false -> null
          - emulatessd           = false -> null
          - format               = "raw" -> null
          - id                   = 0 -> null
          - iops_r_burst         = 0 -> null
          - iops_r_burst_length  = 0 -> null
          - iops_r_concurrent    = 0 -> null
          - iops_wr_burst        = 0 -> null
          - iops_wr_burst_length = 0 -> null
          - iops_wr_concurrent   = 0 -> null
          - iothread             = false -> null
          - linked_disk_id       = -1 -> null
          - mbps_r_burst         = 0 -> null
          - mbps_r_concurrent    = 0 -> null
          - mbps_wr_burst        = 0 -> null
          - mbps_wr_concurrent   = 0 -> null
          - passthrough          = false -> null
          - readonly             = false -> null
          - replicate            = false -> null
          - size                 = "50G" -> null
          - slot                 = "scsi0" -> null
          - storage              = "data2" -> null
          - type                 = "disk" -> null
            # (6 unchanged attributes hidden)
        }

      - network {
          - bridge    = "vmbr0" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:1c:5d:3b" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "77db9758-1239-4a03-8f9b-17b3f204b59c" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.vm["k8s-testing-cp02.yaml"] will be destroyed
  # (because key ["k8s-testing-cp02.yaml"] is not in for_each map)
  - resource "proxmox_vm_qemu" "vm" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - agent_timeout          = 90 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0;ide2;net0" -> null
      - ciupgrade              = false -> null
      - clone_wait             = 10 -> null
      - cores                  = 4 -> null
      - cpu_type               = "host" -> null
      - current_node           = "node03" -> null
      - define_connection_info = true -> null
      - description            = "Managed by Terraform." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "node03/qemu/103" -> null
      - ipconfig0              = "ip=192.168.1.23/24,gw=192.168.1.1" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 8192 -> null
      - name                   = "k8s-testing-cp02" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = true -> null
      - sockets                = 1 -> null
      - tablet                 = true -> null
      - tags                   = "terraform" -> null
      - target_node            = "node03" -> null
      - unused_disk            = [] -> null
      - vm_state               = "stopped" -> null
      - vmid                   = 103 -> null
        # (12 unchanged attributes hidden)

      - disk {
          - backup               = true -> null
          - discard              = false -> null
          - emulatessd           = false -> null
          - id                   = 0 -> null
          - iops_r_burst         = 0 -> null
          - iops_r_burst_length  = 0 -> null
          - iops_r_concurrent    = 0 -> null
          - iops_wr_burst        = 0 -> null
          - iops_wr_burst_length = 0 -> null
          - iops_wr_concurrent   = 0 -> null
          - iothread             = false -> null
          - iso                  = "local:iso/talos-v1.10.3-metal-amd64.iso" -> null
          - linked_disk_id       = 0 -> null
          - mbps_r_burst         = 0 -> null
          - mbps_r_concurrent    = 0 -> null
          - mbps_wr_burst        = 0 -> null
          - mbps_wr_concurrent   = 0 -> null
          - passthrough          = false -> null
          - readonly             = false -> null
          - replicate            = false -> null
          - slot                 = "ide2" -> null
          - type                 = "cdrom" -> null
            # (8 unchanged attributes hidden)
        }
      - disk {
          - backup               = true -> null
          - discard              = false -> null
          - emulatessd           = false -> null
          - format               = "raw" -> null
          - id                   = 0 -> null
          - iops_r_burst         = 0 -> null
          - iops_r_burst_length  = 0 -> null
          - iops_r_concurrent    = 0 -> null
          - iops_wr_burst        = 0 -> null
          - iops_wr_burst_length = 0 -> null
          - iops_wr_concurrent   = 0 -> null
          - iothread             = false -> null
          - linked_disk_id       = -1 -> null
          - mbps_r_burst         = 0 -> null
          - mbps_r_concurrent    = 0 -> null
          - mbps_wr_burst        = 0 -> null
          - mbps_wr_concurrent   = 0 -> null
          - passthrough          = false -> null
          - readonly             = false -> null
          - replicate            = false -> null
          - size                 = "50G" -> null
          - slot                 = "scsi0" -> null
          - storage              = "data2" -> null
          - type                 = "disk" -> null
            # (6 unchanged attributes hidden)
        }

      - network {
          - bridge    = "vmbr0" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:bf:19:e1" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "74e99b53-a632-43a2-b272-43c8463f04bc" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.vm["k8s-testing-cp03.yaml"] will be destroyed
  # (because key ["k8s-testing-cp03.yaml"] is not in for_each map)
  - resource "proxmox_vm_qemu" "vm" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - agent_timeout          = 90 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0;ide2;net0" -> null
      - ciupgrade              = false -> null
      - clone_wait             = 10 -> null
      - cores                  = 4 -> null
      - cpu_type               = "host" -> null
      - current_node           = "node03" -> null
      - define_connection_info = true -> null
      - description            = "Managed by Terraform." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "node03/qemu/112" -> null
      - ipconfig0              = "ip=192.168.1.24/24,gw=192.168.1.1" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 8192 -> null
      - name                   = "k8s-testing-cp03" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = true -> null
      - sockets                = 1 -> null
      - tablet                 = true -> null
      - tags                   = "terraform" -> null
      - target_node            = "node03" -> null
      - unused_disk            = [] -> null
      - vm_state               = "stopped" -> null
      - vmid                   = 112 -> null
        # (12 unchanged attributes hidden)

      - disk {
          - backup               = true -> null
          - discard              = false -> null
          - emulatessd           = false -> null
          - id                   = 0 -> null
          - iops_r_burst         = 0 -> null
          - iops_r_burst_length  = 0 -> null
          - iops_r_concurrent    = 0 -> null
          - iops_wr_burst        = 0 -> null
          - iops_wr_burst_length = 0 -> null
          - iops_wr_concurrent   = 0 -> null
          - iothread             = false -> null
          - iso                  = "local:iso/talos-v1.10.3-metal-amd64.iso" -> null
          - linked_disk_id       = 0 -> null
          - mbps_r_burst         = 0 -> null
          - mbps_r_concurrent    = 0 -> null
          - mbps_wr_burst        = 0 -> null
          - mbps_wr_concurrent   = 0 -> null
          - passthrough          = false -> null
          - readonly             = false -> null
          - replicate            = false -> null
          - slot                 = "ide2" -> null
          - type                 = "cdrom" -> null
            # (8 unchanged attributes hidden)
        }
      - disk {
          - backup               = true -> null
          - discard              = false -> null
          - emulatessd           = false -> null
          - format               = "raw" -> null
          - id                   = 0 -> null
          - iops_r_burst         = 0 -> null
          - iops_r_burst_length  = 0 -> null
          - iops_r_concurrent    = 0 -> null
          - iops_wr_burst        = 0 -> null
          - iops_wr_burst_length = 0 -> null
          - iops_wr_concurrent   = 0 -> null
          - iothread             = false -> null
          - linked_disk_id       = -1 -> null
          - mbps_r_burst         = 0 -> null
          - mbps_r_concurrent    = 0 -> null
          - mbps_wr_burst        = 0 -> null
          - mbps_wr_concurrent   = 0 -> null
          - passthrough          = false -> null
          - readonly             = false -> null
          - replicate            = false -> null
          - size                 = "50G" -> null
          - slot                 = "scsi0" -> null
          - storage              = "data2" -> null
          - type                 = "disk" -> null
            # (6 unchanged attributes hidden)
        }

      - network {
          - bridge    = "vmbr0" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:80:ee:27" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "608c8385-7fb2-4c87-a09d-20ce80e1147c" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.vm["k8s-testing-w01.yaml"] will be destroyed
  # (because key ["k8s-testing-w01.yaml"] is not in for_each map)
  - resource "proxmox_vm_qemu" "vm" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - agent_timeout          = 90 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0;ide2;net0" -> null
      - ciupgrade              = false -> null
      - clone_wait             = 10 -> null
      - cores                  = 4 -> null
      - cpu_type               = "host" -> null
      - current_node           = "node03" -> null
      - define_connection_info = true -> null
      - description            = "Managed by Terraform." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "node03/qemu/114" -> null
      - ipconfig0              = "ip=192.168.1.25/24,gw=192.168.1.1" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 8192 -> null
      - name                   = "k8s-testing-w01" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = true -> null
      - sockets                = 1 -> null
      - tablet                 = true -> null
      - tags                   = "terraform" -> null
      - target_node            = "node03" -> null
      - unused_disk            = [] -> null
      - vm_state               = "stopped" -> null
      - vmid                   = 114 -> null
        # (12 unchanged attributes hidden)

      - disk {
          - backup               = true -> null
          - discard              = false -> null
          - emulatessd           = false -> null
          - id                   = 0 -> null
          - iops_r_burst         = 0 -> null
          - iops_r_burst_length  = 0 -> null
          - iops_r_concurrent    = 0 -> null
          - iops_wr_burst        = 0 -> null
          - iops_wr_burst_length = 0 -> null
          - iops_wr_concurrent   = 0 -> null
          - iothread             = false -> null
          - iso                  = "local:iso/talos-v1.10.3-metal-amd64.iso" -> null
          - linked_disk_id       = 0 -> null
          - mbps_r_burst         = 0 -> null
          - mbps_r_concurrent    = 0 -> null
          - mbps_wr_burst        = 0 -> null
          - mbps_wr_concurrent   = 0 -> null
          - passthrough          = false -> null
          - readonly             = false -> null
          - replicate            = false -> null
          - slot                 = "ide2" -> null
          - type                 = "cdrom" -> null
            # (8 unchanged attributes hidden)
        }
      - disk {
          - backup               = true -> null
          - discard              = false -> null
          - emulatessd           = false -> null
          - format               = "raw" -> null
          - id                   = 0 -> null
          - iops_r_burst         = 0 -> null
          - iops_r_burst_length  = 0 -> null
          - iops_r_concurrent    = 0 -> null
          - iops_wr_burst        = 0 -> null
          - iops_wr_burst_length = 0 -> null
          - iops_wr_concurrent   = 0 -> null
          - iothread             = false -> null
          - linked_disk_id       = -1 -> null
          - mbps_r_burst         = 0 -> null
          - mbps_r_concurrent    = 0 -> null
          - mbps_wr_burst        = 0 -> null
          - mbps_wr_concurrent   = 0 -> null
          - passthrough          = false -> null
          - readonly             = false -> null
          - replicate            = false -> null
          - size                 = "50G" -> null
          - slot                 = "scsi0" -> null
          - storage              = "data2" -> null
          - type                 = "disk" -> null
            # (6 unchanged attributes hidden)
        }

      - network {
          - bridge    = "vmbr0" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:6d:51:c8" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "293f0ccf-c7cc-4a8d-aaa2-8a1ad94463f7" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.vm["k8s-testing-w02.yaml"] will be destroyed
  # (because key ["k8s-testing-w02.yaml"] is not in for_each map)
  - resource "proxmox_vm_qemu" "vm" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - agent_timeout          = 90 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0;ide2;net0" -> null
      - ciupgrade              = false -> null
      - clone_wait             = 10 -> null
      - cores                  = 4 -> null
      - cpu_type               = "host" -> null
      - current_node           = "node03" -> null
      - define_connection_info = true -> null
      - description            = "Managed by Terraform." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "node03/qemu/102" -> null
      - ipconfig0              = "ip=192.168.1.26/24,gw=192.168.1.1" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 8192 -> null
      - name                   = "k8s-testing-w02" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = true -> null
      - sockets                = 1 -> null
      - tablet                 = true -> null
      - tags                   = "terraform" -> null
      - target_node            = "node03" -> null
      - unused_disk            = [] -> null
      - vm_state               = "stopped" -> null
      - vmid                   = 102 -> null
        # (12 unchanged attributes hidden)

      - disk {
          - backup               = true -> null
          - discard              = false -> null
          - emulatessd           = false -> null
          - id                   = 0 -> null
          - iops_r_burst         = 0 -> null
          - iops_r_burst_length  = 0 -> null
          - iops_r_concurrent    = 0 -> null
          - iops_wr_burst        = 0 -> null
          - iops_wr_burst_length = 0 -> null
          - iops_wr_concurrent   = 0 -> null
          - iothread             = false -> null
          - iso                  = "local:iso/talos-v1.10.3-metal-amd64.iso" -> null
          - linked_disk_id       = 0 -> null
          - mbps_r_burst         = 0 -> null
          - mbps_r_concurrent    = 0 -> null
          - mbps_wr_burst        = 0 -> null
          - mbps_wr_concurrent   = 0 -> null
          - passthrough          = false -> null
          - readonly             = false -> null
          - replicate            = false -> null
          - slot                 = "ide2" -> null
          - type                 = "cdrom" -> null
            # (8 unchanged attributes hidden)
        }
      - disk {
          - backup               = true -> null
          - discard              = false -> null
          - emulatessd           = false -> null
          - format               = "raw" -> null
          - id                   = 0 -> null
          - iops_r_burst         = 0 -> null
          - iops_r_burst_length  = 0 -> null
          - iops_r_concurrent    = 0 -> null
          - iops_wr_burst        = 0 -> null
          - iops_wr_burst_length = 0 -> null
          - iops_wr_concurrent   = 0 -> null
          - iothread             = false -> null
          - linked_disk_id       = -1 -> null
          - mbps_r_burst         = 0 -> null
          - mbps_r_concurrent    = 0 -> null
          - mbps_wr_burst        = 0 -> null
          - mbps_wr_concurrent   = 0 -> null
          - passthrough          = false -> null
          - readonly             = false -> null
          - replicate            = false -> null
          - size                 = "50G" -> null
          - slot                 = "scsi0" -> null
          - storage              = "data2" -> null
          - type                 = "disk" -> null
            # (6 unchanged attributes hidden)
        }

      - network {
          - bridge    = "vmbr0" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:8a:50:a7" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "cd2b2f44-0449-4350-b6fb-a3aad0e36cf8" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.vm["k8s-testing-w03.yaml"] will be destroyed
  # (because key ["k8s-testing-w03.yaml"] is not in for_each map)
  - resource "proxmox_vm_qemu" "vm" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - agent_timeout          = 90 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0;ide2;net0" -> null
      - ciupgrade              = false -> null
      - clone_wait             = 10 -> null
      - cores                  = 4 -> null
      - cpu_type               = "host" -> null
      - current_node           = "node03" -> null
      - define_connection_info = true -> null
      - description            = "Managed by Terraform." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "node03/qemu/113" -> null
      - ipconfig0              = "ip=192.168.1.27/24,gw=192.168.1.1" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 8192 -> null
      - name                   = "k8s-testing-w03" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = true -> null
      - sockets                = 1 -> null
      - tablet                 = true -> null
      - tags                   = "terraform" -> null
      - target_node            = "node03" -> null
      - unused_disk            = [] -> null
      - vm_state               = "stopped" -> null
      - vmid                   = 113 -> null
        # (12 unchanged attributes hidden)

      - disk {
          - backup               = true -> null
          - discard              = false -> null
          - emulatessd           = false -> null
          - id                   = 0 -> null
          - iops_r_burst         = 0 -> null
          - iops_r_burst_length  = 0 -> null
          - iops_r_concurrent    = 0 -> null
          - iops_wr_burst        = 0 -> null
          - iops_wr_burst_length = 0 -> null
          - iops_wr_concurrent   = 0 -> null
          - iothread             = false -> null
          - iso                  = "local:iso/talos-v1.10.3-metal-amd64.iso" -> null
          - linked_disk_id       = 0 -> null
          - mbps_r_burst         = 0 -> null
          - mbps_r_concurrent    = 0 -> null
          - mbps_wr_burst        = 0 -> null
          - mbps_wr_concurrent   = 0 -> null
          - passthrough          = false -> null
          - readonly             = false -> null
          - replicate            = false -> null
          - slot                 = "ide2" -> null
          - type                 = "cdrom" -> null
            # (8 unchanged attributes hidden)
        }
      - disk {
          - backup               = true -> null
          - discard              = false -> null
          - emulatessd           = false -> null
          - format               = "raw" -> null
          - id                   = 0 -> null
          - iops_r_burst         = 0 -> null
          - iops_r_burst_length  = 0 -> null
          - iops_r_concurrent    = 0 -> null
          - iops_wr_burst        = 0 -> null
          - iops_wr_burst_length = 0 -> null
          - iops_wr_concurrent   = 0 -> null
          - iothread             = false -> null
          - linked_disk_id       = -1 -> null
          - mbps_r_burst         = 0 -> null
          - mbps_r_concurrent    = 0 -> null
          - mbps_wr_burst        = 0 -> null
          - mbps_wr_concurrent   = 0 -> null
          - passthrough          = false -> null
          - readonly             = false -> null
          - replicate            = false -> null
          - size                 = "50G" -> null
          - slot                 = "scsi0" -> null
          - storage              = "data2" -> null
          - type                 = "disk" -> null
            # (6 unchanged attributes hidden)
        }

      - network {
          - bridge    = "vmbr0" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:de:36:51" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "569f0272-74ac-46c8-adbe-572f05f2571b" -> null
            # (6 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 6 to destroy.

Changes to Outputs:
  ~ k8s_nodes         = {
      - "k8s-testing-cp01.yaml" = {
          - ip   = "ip=192.168.1.22/24,gw=192.168.1.1"
          - node = "node03"
        }
      - "k8s-testing-cp02.yaml" = {
          - ip   = "ip=192.168.1.23/24,gw=192.168.1.1"
          - node = "node03"
        }
      - "k8s-testing-cp03.yaml" = {
          - ip   = "ip=192.168.1.24/24,gw=192.168.1.1"
          - node = "node03"
        }
      - "k8s-testing-w01.yaml"  = {
          - ip   = "ip=192.168.1.25/24,gw=192.168.1.1"
          - node = "node03"
        }
      - "k8s-testing-w02.yaml"  = {
          - ip   = "ip=192.168.1.26/24,gw=192.168.1.1"
          - node = "node03"
        }
      - "k8s-testing-w03.yaml"  = {
          - ip   = "ip=192.168.1.27/24,gw=192.168.1.1"
          - node = "node03"
        }
        # (6 unchanged attributes hidden)
    }
  ~ vm_ips            = {
      + "haproxy-testing.yaml"  = "ip=192.168.1.24/24,gw=192.168.1.1,ip6=dhcp"
      - "k8s-testing-cp01.yaml" = "ip=192.168.1.22/24,gw=192.168.1.1"
      - "k8s-testing-cp02.yaml" = "ip=192.168.1.23/24,gw=192.168.1.1"
      - "k8s-testing-cp03.yaml" = "ip=192.168.1.24/24,gw=192.168.1.1"
      - "k8s-testing-w01.yaml"  = "ip=192.168.1.25/24,gw=192.168.1.1"
      - "k8s-testing-w02.yaml"  = "ip=192.168.1.26/24,gw=192.168.1.1"
      - "k8s-testing-w03.yaml"  = "ip=192.168.1.27/24,gw=192.168.1.1"
        # (9 unchanged attributes hidden)
    }

  ```
  
  Plan exit code: 0
  